Revit 2027 API
SpatialFieldManager.AddSpatialFieldPrimitive Method
Overload List
Name | Description
AddSpatialFieldPrimitive() |  Creates empty analysis results primitive not associated with any geometry element
AddSpatialFieldPrimitive(Reference) |  Creates an empty analysis results primitive associated with a reference.
AddSpatialFieldPrimitive(Curve, Transform) |  Creates empty analysis results primitive associated with a curve and a transform.
AddSpatialFieldPrimitive(Face, Transform) |  Creates empty analysis results primitive associated with a face and a transform.
AddSpatialFieldPrimitive(Reference, SpatialFieldPrimitiveHideMode) |  Creates an empty analysis results primitive associated with a reference, with the option to control how the reference element is hidden.
Top
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace